src/bsl/InformationRegisters/гкс_ИдентификаторыСинхронизируемыхОбъектовWarehouse.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ИдентификаторыСинхронизируемыхОбъектовWarehouse</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыОбъектовWarehouse</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:EnumRef.гкс_НазначенияИспользованияКачества</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.гкс_ПоказателиКачестваWarehouse</v8:Type>
						<v8:Type>cfg:CatalogRef.гкс_ПродукцияWarehouse</v8:Type>
						<v8:Type>cfg:CatalogRef.гкс_КлассификаторСтанцийЖД</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/CommonModules/гкс_ОбменДаннымиWarehouse/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Создает и возвращает пустую таблицу значений для описания правил конвертации свойств объектов.
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица описания конвертации реквизитов:
//     * СвойствоКонфигурации - Строка
//     * СвойствоИсточника - Строка
//     * ИспользуетсяАлгоритмКонвертации - Число
//     * ПравилоКонвертацииСвойства - Строка
//     * ЭтоТабличнаяЧасть - Булево
//
Функция ИнициализацияПравилКонвертацийСвойств() Экспорт

	ОписаниеЧисла = Новый ОписаниеТипов("Число");
	ОписаниеСтроки = Новый ОписаниеТипов("Строка");
	ОписаниеБулево = Новый ОписаниеТипов("Булево");

	ПравилаКонвертации = Новый ТаблицаЗначений;
	ПравилаКонвертации.Колонки.Добавить("СвойствоКонфигурации", ОписаниеСтроки);
	ПравилаКонвертации.Колонки.Добавить("СвойствоИсточника", ОписаниеСтроки);
	ПравилаКонвертации.Колонки.Добавить("ИспользуетсяАлгоритмКонвертации", ОписаниеЧисла);
	ПравилаКонвертации.Колонки.Добавить("ПравилоКонвертацииСвойства");
	ПравилаКонвертации.Колонки.Добавить("ЭтоТабличнаяЧасть", ОписаниеБулево);

	Возврат ПравилаКонвертации;

КонецФункции

// Добавляет правило конвертации свойства в таблицу правил обмена данными
//
// Параметры:
//   ПравилаКонвертации - ТаблицаЗначений - таблица правил конвертации свойств
//   СвойствоКонфигурации - Строка - имя свойства в конфигурации приемника
//   СвойствоИсточника - Строка - имя свойства в источнике данных
//   ИспользуетсяАлгоритмКонвертации - Число - признак использования алгоритма конвертации (0 - не используется)
//   ПравилоКонвертацииСвойства - Строка - имя правила конвертации свойства
//   ЭтоТабличнаяЧасть - Булево - признак того, что свойство является табличной частью
//
Процедура ДобавитьПКС(ПравилаКонвертации, СвойствоКонфигурации, СвойствоИсточника, ИспользуетсяАлгоритмКонвертации = 0,
		ПравилоКонвертацииСвойства = "", ЭтоТабличнаяЧасть = Ложь) Экспорт

	НоваяСтрока                                 = ПравилаКонвертации.Добавить();
	НоваяСтрока.СвойствоКонфигурации            = СвойствоКонфигурации;
	НоваяСтрока.СвойствоИсточника               = СвойствоИсточника;
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = ?(ИспользуетсяАлгоритмКонвертации = 0, Ложь, Истина);
	НоваяСтрока.ПравилоКонвертацииСвойства      = ПравилоКонвертацииСвойства;
	НоваяСтрока.ЭтоТабличнаяЧасть				= ЭтоТабличнаяЧасть;

КонецПроцедуры

// Возвращает структуру со значением ключевого свойства на основе правил конвертации.
//
// Параметры:
//   ПравилаКонвертации - ТаблицаЗначений - правила конвертации свойств
//   СтрокаДанных - Структура - строка исходных данных
//   ИмяКлючевогоСвойства - Строка - имя свойства источника
//
// Возвращаемое значение:
//   Структура - структура с одним свойством, содержащим значение ключевого свойства
//
Функция ЗначенияКлючевыхСвойств(ПравилаКонвертации, СтрокаДанных, ИмяКлючевогоСвойства) Экспорт

	Результат = Новый Структура;

	ПравилоКонвертацииКлючевогоЭлемента = ПравилаКонвертации.Найти(ИмяКлючевогоСвойства, "СвойствоИсточника");
	Если ПравилоКонвертацииКлючевогоЭлемента <> Неопределено Тогда
		Результат.Вставить(ПравилоКонвертацииКлючевогоЭлемента.СвойствоКонфигурации,
							СтрокаДанных[ИмяКлючевогоСвойства]);
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Обрабатывает полученные данные для справочников или документов, создавая новые элементы или обновляя существующие
//
// Параметры:
//   ПолученныеДанные - Структура, Массив из Структура - данные для заполнения объекта
//   СсылкаОбъекта - СправочникСсылка, ДокументСсылка - ссылка на обновляемый объект, если передана
//
Процедура ОбработатьПолученныеДанные(ПолученныеДанные, СсылкаОбъекта) Экспорт

	Перем ЗначениеКлючаПоиска;

	Если Не ЗначениеЗаполнено(ПолученныеДанные) Тогда
		Возврат;
	КонецЕсли;

	ПолноеИмяОбъекта = ОбщегоНазначения.ИмяТаблицыПоСсылке(СсылкаОбъекта);
	ВидОбъекта = ОбщегоНазначения.ВидОбъектаПоСсылке(СсылкаОбъекта);

	Менеджер = Общегоназначения.МенеджерОбъектаПоСсылке(СсылкаОбъекта);
//	ТипОбъектаXDO = Менеджер.ИмяТаблицыЭтран();
	ИмяКлюча = Менеджер.ИмяКлючевогоСвойстваВWarehouse();
	ПравилаКонвертации = Менеджер.ИнициализацияПравилКонвертацийСвойств();

	Если ВидОбъекта = "Справочник" Тогда

		ТекущиеДанныеИБ = ТаблицаЭлементовСправочника(ПолноеИмяОбъекта);

		Для Каждого СтрокаДанных Из ПолученныеДанные Цикл

			ДанныеЗаполнения = СтрокаДанных; //  ПреобразованиеТипов(СтрокаДанных, ТипОбъектаXDO);

			Если ЗначениеЗаполнено(СсылкаОбъекта) Тогда
				ОбновляемыйЭлемент = СсылкаОбъекта.ПолучитьОбъект();
			Иначе

				ПараметрыОтбора = ЗначенияКлючевыхСвойств(ПравилаКонвертации, ДанныеЗаполнения, ИмяКлюча);

				НайденаяЗапись = НайтиСуществующийЭлемент(ТекущиеДанныеИБ, ПараметрыОтбора);
				Если ЗначениеЗаполнено(НайденаяЗапись) Тогда
					ОбновляемыйЭлемент = НайденаяЗапись.ПолучитьОбъект();
					Попытка
						ОбновляемыйЭлемент.Заблокировать();
					Исключение
						Продолжить;
					КонецПопытки;
				Иначе
					ОбновляемыйЭлемент = Менеджер.СоздатьЭлемент();
				КонецЕсли;
			КонецЕсли;

			ОбработатьОбъектКонвератации(ПравилаКонвертации, ДанныеЗаполнения, ОбновляемыйЭлемент);

		КонецЦикла;

	ИначеЕсли ВидОбъекта = "Документ" Тогда

		ДанныеЗаполнения = ПолученныеДанные; //  ПреобразованиеТипов(ПолученныеДанные, ТипОбъектаXDO)

		Если ЗначениеЗаполнено(СсылкаОбъекта) Тогда
			ОбновляемыйДокумент = СсылкаОбъекта.ПолучитьОбъект();
		Иначе
			Если ДанныеЗаполнения.Свойство(ИмяКлюча, ЗначениеКлючаПоиска) Тогда
				ОбновляемыйДокумент = ДокументПоВнешнемуИдентификатору(ЗначениеКлючаПоиска, ПолноеИмяОбъекта, Истина);
			Иначе
				ТекстИсключения = СтрШаблон("Не найдено ключевое поле %1", ИмяКлюча);
				ВызватьИсключение ТекстИсключения;
			КонецЕсли;
		КонецЕсли;

		ОбработатьОбъектКонвератации(ПравилаКонвертации, ДанныеЗаполнения, ОбновляемыйДокумент);
	КонецЕсли;

КонецПроцедуры

// Заполняет свойства объекта данными, полученными при конвертации, и записывает объект.
//
// Параметры:
//   ПравилаКонвертации - ТаблицаЗначений - правила конвертации свойств объекта
//   ПолученныеДанные - Структура - исходные данные для заполнения
//   ОбновляемыйОбъект - Объект - обновляемый объект (ссылка или объект)
//
Процедура ОбработатьОбъектКонвератации(ПравилаКонвертации, ПолученныеДанные, ОбновляемыйОбъект) Экспорт

	ДанныеЗаполнения = КонвертацияВДанныеЗаполненияОбъекта(ОбновляемыйОбъект, ПравилаКонвертации, ПолученныеДанные);

	Для Каждого ЗначениеЗаполнения Из ДанныеЗаполнения Цикл

		Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(
			ОбновляемыйОбъект, ЗначениеЗаполнения.Ключ) Тогда
			Продолжить;
		КонецЕсли;

		ТипОписанияПравила = ТипЗнч(ЗначениеЗаполнения.Значение);

		Если ТипОписанияПравила = Тип("ТаблицаЗначений") Тогда
			ОбновляемыйОбъект[ЗначениеЗаполнения.Ключ].Загрузить(ЗначениеЗаполнения.Значение);
		Иначе
			// из-за разниц форматов дат в зависимости от сервера делаем преобразование тут
			Если ТипЗнч(ОбновляемыйОбъект[ЗначениеЗаполнения.Ключ]) = Тип("Дата")
				И ТипОписанияПравила = Тип("Строка") Тогда

				ОбновляемыйОбъект[ЗначениеЗаполнения.Ключ] =
					СтроковыеФункцииКлиентСервер.СтрокаВДату(ЗначениеЗаполнения.Значение, ЧастиДаты.ДатаВремя);
			Иначе
				ОбновляемыйОбъект[ЗначениеЗаполнения.Ключ] = ЗначениеЗаполнения.Значение;
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

	Попытка
		ОбновляемыйОбъект.ОбменДанными.Загрузка = Истина;
    	ОбновляемыйОбъект.Записать();
	Исключение
		СообщениеОбОшибке = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());

		ЗаписьЖурналаРегистрации(
			"Интеграция Warehouse. Обновление данных из Warehouse",
			УровеньЖурналаРегистрации.Ошибка,,,
			СообщениеОбОшибке);

		ПолноеИмяОбъекта = ОбщегоНазначения.ИмяТаблицыПоСсылке(ОбновляемыйОбъект.Ссылка);

		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не удалось записать %1'"), ПолноеИмяОбъекта);
	КонецПопытки;

КонецПроцедуры

// Преобразует полученные данные в структуру заполнения объекта в соответствии с правилами конвертации.
//
// Параметры:
//   ОбновляемыйОбъект - СправочникОбъект, ДокументОбъект - Объект конфигурации,
//   														для которого выполняется конвертация
//   ПравилаКонвертации - Массив из Структура - Массив правил конвертации свойств
//   ПолученныеДанные - Структура - Исходные данные для заполнения объекта
//
// Возвращаемое значение:
//   Структура - Структура данных для заполнения объекта
//
Функция КонвертацияВДанныеЗаполненияОбъекта(ОбновляемыйОбъект, ПравилаКонвертации, ПолученныеДанные) Экспорт

	Перем ЗначениеЗаполнения, ДанныеТЧ;

	ДанныеЗаполнения = Новый Структура;

	Для Каждого ПравилоКонвертации Из ПравилаКонвертации Цикл

		Если ПравилоКонвертации.ИспользуетсяАлгоритмКонвертации Тогда

			ПараметрыОбработчика = Новый Массив();
			ПараметрыОбработчика.Добавить(ПравилоКонвертации);
			ПараметрыОбработчика.Добавить(ПолученныеДанные);
			ПараметрыОбработчика.Добавить(ДанныеЗаполнения);

			ОбщегоНазначения.ВыполнитьМетодОбъекта(ОбновляемыйОбъект,
				ПравилоКонвертации.ПравилоКонвертацииСвойства, ПараметрыОбработчика);

		ИначеЕсли ПравилоКонвертации.ЭтоТабличнаяЧасть Тогда

			ПравилаКонвертацииТЧ = ПравилоКонвертации.ПравилоКонвертацииСвойства;
			ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ДанныеТЧ);

			ДанныеЗаполненияТЧ = ОбновляемыйОбъект[ПравилоКонвертации.СвойствоКонфигурации].Выгрузить();
			ДанныеЗаполненияТЧ.Очистить();

			Для Каждого СтрокаТЧ Из ДанныеТЧ Цикл

				ДанныеЗаполненияСтрокиТЧ = КонвертацияВДанныеЗаполненияОбъекта(
					ОбновляемыйОбъект, ПравилаКонвертацииТЧ, СтрокаТЧ);

				Если ЗначениеЗаполнено(ДанныеЗаполненияСтрокиТЧ) Тогда
					СтрокаДанныхЗаполненияТЧ = ДанныеЗаполненияТЧ.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаДанныхЗаполненияТЧ, ДанныеЗаполненияСтрокиТЧ);
				КонецЕсли;
			КонецЦикла;

			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ДанныеЗаполненияТЧ);

		Иначе
			ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ЗначениеЗаполнения);
			Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда

				//Если ТипЗнч(ОбновляемыйОбъект[ПравилоКонвертации.СвойствоКонфигурации]) = Тип("Дата")
				//	И ТипЗнч(ЗначениеЗаполнения) = Тип("Строка") Тогда
				//
				//ЗначениеЗаполнения = СтроковыеФункцииКлиентСервер.СтрокаВДату(ЗначениеЗаполнения, ЧастиДаты.ДатаВремя);
				//КонецЕсли;

				ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

	Возврат ДанныеЗаполнения;

КонецФункции

// Возвращает документ по внешнему идентификатору. Если документ не найден и разрешено создание,
// создает новый документ указанного типа.
//
// Параметры:
//   Идентификатор - Строка - внешний идентификатор документа
//   ПолноеИмяОбъекта - Строка - полное имя метаданных документа
//   СоздатьОбъект - Булево - признак необходимости создания нового документа при отсутствии найденного
//
// Возвращаемое значение:
//   ДокументОбъект - найденный или созданный документ
//   Неопределено - документ не найден и создание не разрешено
//
Функция ДокументПоВнешнемуИдентификатору(Идентификатор, ПолноеИмяОбъекта, СоздатьОбъект = Ложь) Экспорт

	СсылкаНаОбъект = СсылкаНаОбъектПоИдентификатору(Идентификатор, ПолноеИмяОбъекта);

	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Результат = СсылкаНаОбъект.ПолучитьОбъект();

	ИначеЕсли СоздатьОбъект Тогда
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъекта);
		Результат = МенеджерОбъекта.СоздатьДокумент();
	Иначе
		Результат = Неопределено;
	КонецЕсли;

    Возврат Результат;

КонецФункции

// Находит элемент по внешнему идентификатору или создает новый элемент справочника при необходимости.
//
// Параметры:
//   ПолноеИмяОбъекта - Строка - Полное имя объекта метаданных
//   КлючПоиска - Строка, УникальныйИдентификатор - Внешний идентификатор для поиска
//   ДанныеЗаполнения - Произвольный - Данные для заполнения свойств нового объекта
//   СоздаватьЕслиНеНайден - Булево - Признак создания нового объекта, если не найден
//
// Возвращаемое значение:
//   - СправочникСсылка - Найденная или созданная ссылка на объект
//   - Неопределено - Объект не найден и создание запрещено
//
Функция ЭлементПоВнешнимДанным(ПолноеИмяОбъекта, КлючПоиска, ДанныеЗаполнения, СоздаватьЕслиНеНайден = Истина) Экспорт

	СсылкаНаОбъект = СсылкаНаОбъектПоИдентификатору(КлючПоиска, ПолноеИмяОбъекта);

	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Результат = СсылкаНаОбъект;

	ИначеЕсли СоздаватьЕслиНеНайден Тогда
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъекта);
		НовыйОбъект = Менеджер.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НовыйОбъект, ДанныеЗаполнения);
		НовыйОбъект.Записать();

		Результат = НовыйОбъект.Ссылка;
	Иначе
		Результат = Неопределено;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Возвращает ссылку на объект по идентификатору внешней системы
//
// Параметры:
//   Идентификатор - Строка, Число - значение ключа из внешней системы
//   ПолноеИмяОбъекта - Строка - полное имя объекта вида "Справочник.гкс_ЭтранСтраны"
//   ВладелецСправочника - СправочникСсылка - ссылка на владельца элемента справочника
//
// Возвращаемое значение:
//   СправочникСсылка, ДокументСсылка - ссылка на найденный объект
//   Неопределено - объект не найден
//
Функция СсылкаНаОбъектПоИдентификатору(Идентификатор, ПолноеИмяОбъекта, ВладелецСправочника = Неопределено) Экспорт

	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъекта);
	ИмяРеквизитаКлюча = МенеджерОбъекта.ИмяКлючевогоСвойства();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);

	Если ВладелецСправочника <> Неопределено
		И ТипЗнч(ВладелецСправочника) = Тип("СправочникСсылка") Тогда

		 ТекстУсловияПоВладельцу = "И Объект.Владелец = &ВладелецСправочника";
		 Запрос.УстановитьПараметр("ВладелецСправочника", ВладелецСправочника);
	Иначе
		 ТекстУсловияПоВладельцу = "";
	КонецЕсли;

	СтрокаШаблона = "ВЫБРАТЬ ПЕРВЫЕ 1
				|	Объект.Ссылка КАК Ссылка
				|ИЗ
				|	%1 КАК Объект
				|ГДЕ
				|	Объект.%2 = &Идентификатор
				|	%3";

	Запрос.Текст = СтрШаблон(СтрокаШаблона, ПолноеИмяОбъекта, ИмяРеквизитаКлюча, ТекстУсловияПоВладельцу);

	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Результат = ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Результат = Неопределено;
	КонецЕсли;

    Возврат Результат;

КонецФункции

// Возвращает ссылку объекта информационной базы по идентификатору из системы Warehouse.
// Если ссылка не найдена, создает запись соответствия.
//
// Параметры:
//   ИдентификаторWarehouse - Строка, УникальныйИдентификатор - идентификатор объекта в Warehouse
//   ТипОбъекта - Строка - тип объекта
//   ПредставлениеОбъекта - Строка - представление объекта
//
// Возвращаемое значение:
//   СправочникСсылка, ДокументСсылка - ссылка на объект информационной базы
//
Функция СсылкаИБПоСоотвествиюИдентификаторов(ИдентификаторWarehouse, ТипОбъекта, ПредставлениеОбъекта) Экспорт

	МенеджерИдОбъекты = РегистрыСведений.гкс_ИдентификаторыСинхронизируемыхОбъектовWarehouse;
	СсылкаИБ = МенеджерИдОбъекты.СсылкаОбъектаПоИдентификатору(ИдентификаторWarehouse);

	Если Не ЗначениеЗаполнено(СсылкаИБ) Тогда

		ЗаписьЗначения = МенеджерИдОбъекты.СтруктураЗаписи();
		ЗаписьЗначения.Идентификатор = ИдентификаторWarehouse;
		ЗаписьЗначения.ТипОбъекта = ТипОбъекта;
		ЗаписьЗначения.НаименованиеОбъекта = ПредставлениеОбъекта;

		МенеджерИдОбъекты.ДобавитьЗапись(ЗаписьЗначения, Истина);
	КонецЕсли;

	Возврат СсылкаИБ;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выгружает все данные из таблицы справочника по указанному полному имени объекта метаданных.
//
// Параметры:
//   ПолноеИмяОбъекта - Строка - Полное имя объекта метаданного (например, "Справочник.Номенклатура")
//
// Возвращаемое значение:
//   ТаблицаЗначений - Таблица с данными справочника
//
Функция ТаблицаЭлементовСправочника(ПолноеИмяОбъекта)

	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон("ВЫБРАТЬ * ИЗ %1", ПолноеИмяОбъекта);

	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Выгрузить();

КонецФункции

// Ищет элемент в текущих данных информационной базы по заданным параметрам отбора.
//
// Параметры:
//   ТекущиеДанныеИБ - ТаблицаЗначений - таблица с данными для поиска
//   ПараметрыОтбора - Структура - параметры для поиска строк
//
// Возвращаемое значение:
//   СправочникСсылка - ссылка на найденный элемент
//   Неопределено - элемент не найден
//
Функция НайтиСуществующийЭлемент(ТекущиеДанныеИБ, ПараметрыОтбора)

	ИндексПервой = 0;

	НайденыеЗаписи = ТекущиеДанныеИБ.НайтиСтроки(ПараметрыОтбора);
	Если НайденыеЗаписи.Количество() > 0 Тогда
		Результат = НайденыеЗаписи[ИндексПервой].Ссылка;
	Иначе
		Результат = Неопределено;
	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти
